Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: མཆོད་ཡོན་སྦྱིན་པར་བྱས་ན་གཏེར་སྲུང་བ་དེ་ཇི་སྲིད་འཚོའི་བར་དུ་ལས་བྱས་པ་པོར་འགྱུར་རོ། །གང་དུ་མངགས་པ་དང་། གང་བསྒོ་བའི་ལས་དེ་ཐམས་ཅད་བྱེད་པར་འགྱུར་རོ།
en: The vidyā holder should offer a bali and argha water to the guardian, who will subsequently remain his servant for the rest of the vidyā holder’s life, going wherever he is sent and carrying out all the tasks he is asked to. “

source: །ཡུངས་ཀར་དང་ཐལ་བ་ལ་དོན་ཡོད་པའི་རྒྱལ་པོའི་སྙིང་པོ་ལན་བདུན་བཟླས་བརྗོད་བྱས་ཏེ་ཕྱོགས་བཞིར་གཏོར་ན་བགེགས་དང་། ལོག་འདྲེན་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། འབྱུང་པོ་ཐམས་ཅད་བཅིངས་པར་འགྱུར་རོ། །མཚམས་ཆེན་པོ་བཅིང་བར་བྱས་པར་འགྱུར་རོ། །ལོག་འདྲེན་ཕུང་བར་བྱ་ན་ཡུངས་མར་དང་།
en: If the vidyā holder incants ashes and mustard seeds seven times with the heart mantra of Amogharāja and casts them in the four directions, all the vighnas, vināyakas, yakṣas, rākṣasas, and bhūtas will be bound, and a great protective boundary will be created.

source: ཡུངས་ཀར་དང་། གུ་གུལ་དང་། སྐེ་ཚེའི་འབྲུ་དང་། ལན་ཚྭ་རྣམས་སྦྲང་རྩི་དང་བསྲེས་ལ་ཤིང་ཀར་བཱི་རའི་ཡ་མ་སྲེག་ཤིང་གི་མེ་བུས་ཏེ། ཉིན་བར་དུས་གསུམ་དུ་བརྒྱ་རྩ་བརྒྱད་སྦྱིན་སྲེག་བྱས་ན་ལོག་འདྲེན་གྱི་རིགས་ཐམས་ཅད་བཅོམ་པར་འགྱུར་ཞིང་རྣམ་པར་ཞི་བར་འགྱུར་རོ།
en: If the vidyā holder wants to destroy vināyakas, he should make a fire with oleander sticks and offer one hundred and eight homas of white mustard, yellow mustard, bdellium, datura seeds, and sea salt mixed with honey at the three junctions of the day for three days.

source: །དམག་བཅིང་བར་འདོད་པས་ཡུངས་ཀར་དང་།
en: This will bring all the families of vināyakas to ruin.

source: དུག་དང་།
en: They will perish. “

source: སྐེ་ཚེའི་འབྲུ་དང་། ས་བོན་བདུན་རྣམས་སྦྲང་རྩི་དང་སྦྱར་ལ་དམག་གི་མདུན་དུ་ཤིང་ནིམ་པའི་མེ་སྦར་ཏེ།
en: If the vidyā holder wants to paralyze an army, he should make a fire with neem sticks and, facing the army, offer homas of mustard seeds, viśarājikā, and saptabījaka mixed with honey.

source: ཐོག་མར་བརྒྱད་བརྒྱ་བྱས་ན་དམག་བཅིང་བར་འགྱུར་རོ། །ལན་གཉིས་བྱས་ན་ནད་ཆེན་པོ་འབྱུང་བར་འགྱུར་རོ། །བརྒྱད་བརྒྱ་བཟླས་བརྗོད་ལན་གསུམ་པ་བྱས་ན། དམག་ཐམས་ཅད་ཞིག་པར་འགྱུར་ཞིང་ཕྱིར་ཡང་ལན་འགའ་ཡང་འོང་བར་མི་འགྱུར་རོ།
en: The army will be paralyzed after the first one hundred and eight recitations; after the second, the soldiers will be beset with serious diseases; after the third, all of them will perish and never return. “

source: །དེ་ནས་དབྱུག་པ་སྒྲུབ་པ་སེང་ལྡེང་ལས་གཤིན་རྗེའི་དབྱུག་པའི་ཚད་ཁྲུ་དོ་པ་བྱའོ།
en: If the vidyā holder wants to perform the rite of the rod, he should use cutch wood to fashion a rod two cubits long that is like Yama’s rod.

source: །དེ་ནས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་སྤྱན་སྔར་ཟས་དཀར་གསུམ་ཟོས་ཏེ།
en: Subsisting on the three ‘white’ foods, he should recite the mantra in front of the painting of Noble Avalokiteśvara ten thousand times.

source: སྟོང་ཕྲག་བཅུར་བཟླས་བརྗོད་བྱའོ། །དེ་ནས་ཚེས་བཅོ་ལྔ་ཚང་བའི་ཚེ་སྨྱུང་བ་བྱས་ཏེ། དོན་ཡོད་པའི་རྒྱལ་པོའི་སྙིང་པོ་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བྱའོ། །ཁྲོ་བོའི་རྒྱལ་པོ་བརྒྱ་རྩ་བརྒྱད་བཟླས་པ་བྱས་ན་དེ་ནས་དབྱུག་པ་འབར་རོ།
en: Then, on the fifteenth lunar day, the day of the full moon, after fasting for one day and one night, he should recite the heart mantra of Amogharāja one hundred and eight times and the mantra of Krodharāja the same number of times.

source: །དེ་ནས་གྲུབ་པ་ཡིན་པར་ཤེས་པར་བྱའོ།
en: The rod will blaze with light, the sign by which the vidyā holder will know that the practice has been accomplished.

source: །དོན་ཡོད་པའི་དབྱུག་པ་ཞེས་བྱ་བའི་སྒྲ་འབྱུང་བར་འགྱུར་རོ།
en: He will hear the words ‘amogha rod’ spoken.

source: །དེ་ནས་འཕགས་པ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་ཕྱུག་ལ་མཆོད་པ་བྱའོ།
en: He should make large offerings to Noble Avalokiteśvara. “

source: །དེ་ནས་རིག་སྔགས་འཆང་བ་དབྱུག་པ་བླངས་ཏེ་ཀུན་དུ་ལན་བདུན་བསྐོར་བར་བྱའོ། །དེ་ནས་དབྱུག་པ་དེ་ས་ལ་བརྡབ་པར་བྱའོ།
en: Taking hold of the rod, the vidyā holder should rotate it in a circle seven times and then strike the earth.

source: །དབྱུག་པས་ས་ལ་གྲུ་བཞིར་གཞལ་བར་བྱས་ན་ཀུན་ཏུ་གྲུ་བཞི་ལྷམ་པའི་ཁྱིམ་ཆེན་པོ་གཞལ་མེད་ཁང་འབྱུང་བར་འགྱུར་ཏེ། ཕུན་སུམ་ཚོགས་པ་རྣམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པའི་ལྷའི་གཞལ་མེད་ཁང་འབྱུང་བར་འགྱུར་རོ།
en: He should use the rod to measure out a square area on the ground; a great residential mansion will appear in each of its four corners, and a celestial palace fully provided with all kinds of amenities will appear in the center.

source: །བུད་མེད་དང་། སྐྱེས་པ་དང་། ཁྱེའུ་དང་། བུ་མོའི་སྐྱེ་བོས་གང་བར་འགྱུར་རོ།
en: It will be crowded with women, men, boys, and girls.

source: །དེ་ནས་ལྷ་མོ་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ། བཟང་བ། མཛེས་པ། བལྟ་བར་འོས་པ་ཞིག་འོངས་ནས་རིན་པོ་ཆེ་བདུན་ལས་བྱས་པའི་སྣོད་བུམ་པ་གང་བ་ཞིག་ཐོགས་ཤིང་སྒོའི་ནང་དུ་འདུག་གོ།
en: A celestial woman—one who is adorned with every ornament and is beautiful, graceful, and pleasing to look at—will come forward, and while standing in the doorway she will hold out a full jar made of the seven types of jewels.

source: །དེ་ནས་ལྷ་མོ་དོན་རེ་རིག་སྔགས་འཆང་གི་ཁྱིམ་ཡིན་གྱིས་ནང་དུ་ཞུགས་ཤིག་ཅེས་སྨྲ་བར་འགྱུར་རོ།
en: The celestial woman will say, ‘Enter, O vidyā holder!

source: །རིག་སྔགས་འཆང་བས་སྙིང་པོ་མེད་པར་འགྱུར་བའི་ཁྱིམ་གཞལ་མེད་ཁང་འདིས་ཅི་ཞིག་བྱ་ཞེས་བརྗོད་པར་བྱའོ།
en: This palace is your own!’ He should reply, ‘What would I do in this worthless palatial dwelling?’

source: །དེ་ན་དེ་སྣོད་གང་བ་འདི་ལོང་ཤིག་དང་།
en: She will say, ‘Accept this vessel!

source: རྒྱ་ཆེར་འཕེལ་བར་འགྱུར་རོ་ཞེས་སྨྲ་བར་འགྱུར་རོ།
en: It will bring you great prosperity.’

source: །རིག་སྔགས་འཆང་བས་དྷིག་དྷིག་ཅེས་ཁྲོས་པ་བྱས་པ་དང་།
en: He should then curse her angrily, which will cause the woman to cry and shed tears as big as drops of heavy rainfall.

source: ལྷ་མོ་དེ་དུས་ཏེ་ཇི་ལྟར་ཆར་པ་ཆེར་འབབས་པ་དེ་བཞིན་དུ་འདིའི་མིག་ནས་མཆི་མ་བྱུང་བ་དང་རིག་སྔགས་འཆང་བས་བླང་བར་བྱ་ཞིང་རང་གི་ལུས་ལ་བསྐུ་བར་བྱའོ།
en: The vidyā holder should scoop up some of the tears and wipe them on his body.

source: །བསྐུས་པ་ཙམ་གྱི་མོད་ལ་འཛམ་བུའི་གླིང་གི་གསེར་ལྟ་བུའི་ལུས་སུ་འགྱུར་རོ། །ཙནྡན་སྦྲུལ་གྱི་སྙིང་པོ་དང་། གོ་ཤིརྵའི་དྲི་ལུས་ལས་འབྱུང་བར་འགྱུར་རོ།
en: As soon as he does, his body will become the color of the gold from the Jambu river and will exude the scent of the uragasāra and gośīrṣa sandalwood.

source: །ཁར་བཅུག་ན་ལྟ་རྫས་ཀྱི་ཨུཏྤ་ལའི་དྲི་ཁ་ནས་འབྱུང་བར་འགྱུར་རོ།
en: If he puts some of the tears into his mouth, his breath will have the divine smell of blue lotuses.

source: །མཆི་མ་དེ་མིག་ཏུ་བསྐུས་ན་ལྷ་རྫས་ཀྱི་ཨུཏྤལ་སྔོན་པོ་འདྲ་བའི་ལྷའི་མིག་ཏུ་འགྱུར་རོ།
en: If he anoints his eyes with them, they will turn blue like blue lotuses and take on a divine appearance.

source: །སྐྲ་ལ་བསྐུས་ན་ལྷའི་རྨ་བྱའི་མདོག་འདྲ་བའི་སྐྲར་འགྱུར་ཞིང་སྐྲ་འཁྱིལ་ལ་འཁྱིལ་བར་འགྱུར་རོ།
en: If he rubs some into his hair, it will take on the colors of peacock feathers and become wavy and curly.

source: །རྣ་བའི་བུ་གར་བླུགས་ན་ལྷའི་སྙན་དུ་འགྱུར་ཏེ།
en: If he places the tears in his ears, he will develop divine hearing.

source: དཔག་ཚད་སྟོང་ཕྲག་གསུམ་དུ་ཐོས་པར་འགྱུར་རོ། །དཔག་ཚད་སྟོང་ཕྲག་གསུམ་དུ་མཐོང་བར་འགྱུར་རོ།
en: He will be able to hear and see objects at the distance of three thousand leagues. “

source: །འཐུངས་ན་བསྐལ་པ་སྟོང་ཕྲག་བཅུ་འཚོ་བར་འགྱུར་རོ། །བར་གྱི་བསྐལ་བ་རྗེས་སུ་དྲན་པར་འགྱུར་རོ། །གར་ཐབས་དང་། ཏྲོ་ཊ་ཀ་དང་། བརྡ་སྤྲོད་པ་དང་། བསྟན་བཅོས་དང་། བྷ་ར་ཏ་དང་། རཱ་མ་ཡ་ཎ་དང་།
en: If he drinks the tears, his lifespan will increase to ten thousand eons.

source: སྔོན་གྱི་གཏམ་རྙིང་དང་། ཚུལ་དང་། འདུལ་བ་དང་། སྐྱེས་རབས་དང་།
en: He will be able to recall his former births as far back as one thousand eons.

source: སྙན་དང་གས་དང་བྱེ་བྲག་པ་ཐམས་ཅད་དང་། ཆོ་ག་ཞིབ་མོ་ཐམས་ཅད་དང་། དཀྱིལ་འཁོར་དང་། ཕྱག་རྒྱ་དང་། གསང་སྔགས་དང་། གཟུངས་དང་། མདོ་སྡེ་དང་། ཆོས་མངོན་པ་དང་།
en: He will obtain direct insight into all the worldly and celestial dramas, works on grammar, scientific treatises, the Mahābhārata and the Rāmāyaṇa, the Purāṇas, works on polity, works on monastic rules, the birth stories of the Buddha, works on poetics, works on the Vaiśeṣika philosophy, all ritual works on maṇḍalas, mudrās, mantras, and dhāraṇīs, the sūtras, the Abhidharma, and all the Mahāyāna works.

source: ཐེག་པ་ཆེན་པོ་དང་། དེ་དག་ཐམས་ཅད་མངོན་དུ་གྱུར་པར་གནས་སོ། །ཐམས་ཅད་དུ་རྟོགས་པ་ཁོང་དུ་ཆུད་པ་ཆེན་པོར་འགྱུར་རོ།
en: He will follow a distinguished career in every respect. “

source: །དེ་ནས་བུད་མེད་དེ་ན་རེ་རྗེ་བཙུན་དམ་པ་རང་གི་ཁབ་མཆོག་ཏུ་གཤེགས་སུ་གསོལ་ཞེས་སྨྲ་བར་འགྱུར་རོ།
en: The woman will again say, ‘Please enter, dear friend!

source: །རིག་སྔགས་འཆང་བས་བརྗོད་པར་བྱ་ཞིང་རང་གི་རྐང་པ་རིམ་གྱིས་འཇུག་པར་བྱའོ།
en: This is your house!’ The vidyā holder should reply, and he should enter step by step.

source: །དེ་ནས་བུད་མེད་དེ་ནུ་མ་གཉིས་སྟོན་པར་བྱེད་ན་རིག་སྔགས་འཆང་བས་ནུ་མ་གཉིས་བཟུང་ལ་བཙིར་ན་དེ་ལས་འོ་མ་འཛག་པར་འགྱུར་རོ།
en: When she exposes her breasts, the vidyā holder should grasp and squeeze them, causing milk to flow.

source: །དེ་ནས་རིག་སྔགས་འཆང་བས་བླང་བར་བྱ། བཏུང་བར་བྱ།
en: He should scoop it up and drink it.

source: རྐང་པ་ལ་བསྐུ་བར་བྱས་ན་བསྐུས་པ་ཙམ་གྱི་མོད་ལ་འཁོར་སྟོང་དང་ལྷ་མོ་དེ་དང་ལྷན་ཅིག་ཏུ་ནམ་མཁའ་ལ་འཕུར་ཏེ་འགྲོ་བར་འགྱུར་རོ།
en: If he smears some on his feet, he will immediately ascend into the sky in the company of the celestial woman and her thousandfold retinue.

source: །རླུང་གི་ཕུང་པོ་དང་པོ་ལ་ཞོན་པར་འགྱུར་རིག་འཛིན་འཁོར་ལོས་སྒྱུར་པ་སྟོང་ཕྲག་བདུན་ཅུ་རྩ་བཞི་རྣམས་ཀྱི་རིག་འཛིན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་དང་དཔོན་པོར་འགྱུར་རོ།
en: First, he will be borne by a mass of air, and then he will become a king and emperor of the eighty-four thousand vidyādharas.

source: །བདེ་བ་ཅན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་འགྲོ་བར་འགྱུར་རོ། །དེ་ཉིད་རིག་འཛིན་རྣམས་ཀྱི་མཆོག་ཏུ་འགྱུར་ཏེ།
en: He will enter the realm of Sukhāvatī as the chief vidyādhara. “

source: འཇིག་རྟེན་པའི་ཆོ་ག་བསྒྲུབ་པ་ཡིན་ནོ། །དབྱུག་པ་ལག་པ་གཡས་པས་བཟུང་སྟེ། དོན་ཡོད་པའི་རྒྱལ་པོའི་སྙིང་པོ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་བརྗོད་བྱ་ཞིང་ལན་བདུན་བསྐོར་བ་བྱས་ན་དོན་གང་ཡིད་ལ་སེམས་པ་དང་།
en: There is also the following worldly procedure: the vidyā holder should grasp the rod with his right hand while reciting the heart mantra of Amogharāja twenty-one times and rotating the rod seven times.

source: གང་འདོད་པ་དེ་དག་ཐམས་ཅད་སྐད་ཅིག་ཏུ་འགྲུབ་པར་འགྱུར་རོ།
en: Any wish that comes to his mind, any request, will be fully realized in an instant.

source: །གང་དགུག་པ་དེ་དག་ཐམས་ཅད་བཀུག་ཅིང་མདུན་ན་གནས་པར་འགྱུར་རོ།
en: Whomever the vidyā holder attempts to bring into his presence will be summoned and stand in front of him.

source: །གནོད་སྦྱིན་དང་། གནོད་སྦྱིན་མོ་དགུག་པར་འདོད་ན་བཙག་གིས་རི་མོ་བྲིས་ལ་དབྱུག་པ་ལ་དོན་ཡོད་པའི་རྒྱལ་པོ་ལན་བདུན་བཟླས་བརྗོད་བྱ་ཞིང་། གནོད་སྦྱིན་དང་། གནོད་སྦྱིན་མེའི་སྟེང་དུ་བསྐོར་བར་བྱའོ། །གུ་གུལ་གྱི་བདུག་པ་སྦྱིན་པར་བྱའོ།
en: If he wants to summon a yakṣa and a yakṣiṇī, he should draw them with red chalk, incant the rod with the Amogharāja mantra seven times, and swing the rod above the yakṣa and yakṣiṇī.

source: །གཏོར་མ་དཀར་པོ་ཅན་གྱི་སྣོད་དབུལ་བར་བྱའོ།
en: He should burn incense of bdellium and offer a dish with a bali offering of ‘white’ foods.

source: །ལན་བདུན་བསྐོར་བ་ཙམ་གྱི་མོད་ལ་གནོད་སྦྱིན་དང་། གནོད་སྦྱིན་མོ་མདུན་ན་འདུག་ཅིང་བཀའ་བཞིན་དུ་བྱེད་པར་འགྱུར་རོ།
en: As soon as he swings the rod, both the yakṣa and the yakṣiṇī will appear in front of him and follow his orders.

source: །གང་བསྒོ་བའི་ལས་དེ་བྱེད་པར་འགྱུར་རོ། །ཐམས་ཅད་མ་ཚང་བ་མེད་པར་སྒྲུབ་པར་འགྱུར་རོ། །ནོར་དང་། འབྲུ་དང་། དབྱིག་དང་།
en: They will do whatever task he commands them to do, and they will accomplish everything perfectly.

source: ནོར་བུ་དང་། མུ་ཏིག་དང་། དངུལ་དང་། ས་ལེ་སྦྲམ་དང་། གོས་དང་། མལ་སྟན་དང་། ཆོས་གོས་དང་། རྒྱན་གྱི་རྣམ་པ་ལ་སོགས་པ་སྒྲུབ་པར་བྱེད་པར་འགྱུར་རོ།
en: They will procure money, grain, gold, jewels, pearls, silver, wrought gold, clothes, beds, seats, adornments, ornaments, jewelry, and so forth.

source: །གཞན་གང་བསྒོ་བ་དེ་ཐམས་ཅད་སྒྲུབ་པར་བྱེད་དོ།
en: Whatever else he asks them to procure, they will procure it all. “

source: །དཔལ་ལྷ་མོའི་མདུན་དུ་བསྐོར་ན་ནོར་གྱི་མཆོག་རྣམ་པ་མང་དུ་སྦྱིན་པར་བྱེད་དོ།
en: If the vidyā holder swings the rod before an image of Śrī, she will bestow upon him a great quantity of the finest riches.

source: །མདུན་ན་རང་གི་ངོ་བོ་གནས་པར་འགྱུར་རོ། །གང་འདོད་པ་དེ་ཐམས་ཅད་སྦྱིན་པར་བྱེད་དོ།
en: She will appear before him in person and grant him whatever he asks for.

source: །རྣམ་ཐོས་སྲས་ཀྱི་ཞབས་ལ་ལན་བདུན་བརྡབ་ཅིང་དོན་ཡོད་པའི་རྒྱལ་པོ་ལ་ལན་ཉི་ཤུ་རྩ་གཅིག་དྲན་པར་བྱས་ན་རྣམ་ཐོས་ཀྱི་སྲས་རྒྱུག་ཅིང་མདུན་ན་གནས་པར་འགྱུར་རོ།
en: If he strikes Vaiśravaṇa’s feet with the rod seven times and mindfully repeats the heart mantra of Amogharāja twenty-one times, Vaiśravaṇa will come running and will stand directly before him.

source: །ནོར་མང་དུ་སྦྱིན་པར་མཛད་དོ། །གང་འདོད་པ་དེ་ཐམས་ཅད་མཛད་པར་འགྱུར་རོ།
en: He will give abundant wealth and do whatever he is asked to do.

source: །མི་སྨྲ་བར་དབྱུག་པ་ལ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་བརྗོད་བྱ་ཞིང་རྒྱལ་པོའི་སྒོར་ལན་བདུན་བསྐོར་བ་བྱས་ན་རྒྱལ་པོ་དང་། བཙུན་མོའི་འཁོར་རྣམས་བདག་ཉིད་དང་། ནོར་ལ་དབང་བར་འགྱུར་རོ།
en: If the vidyā holder silently incants the rod twenty-one times and swings it at the gate of the royal household seven times, the king, together with his harem and retinue, will fall under the vidyā holder’s thrall and serve him with their bodies and wealth. “

source: །གྲོང་ཁྱེར་གྱི་སྒོར་བསྐོར་ན་གྲོང་ཁྱེར་ན་གནས་པའི་བུད་མེད་དང་། སྐྱེས་པ་དང་། ཁྱེའུ་དང་བུ་མོ་རྣམས་དབང་དུ་འགྱུར་ཞིང་གནས་སོ།
en: If the vidyā holder swings the rod at the gates to a city, all its citizens—women, men, boys, and girls—will fall under his thrall.

source: །དེ་གཅིག་པུ་མཆོད་པར་འོས་པར་འགྱུར་རོ། །དེ་དག་ཐམས་ཅད་བྲན་ཕོ་དང་བྲན་མོ་བཞིན་དུ་རྗེས་སུ་འབྲང་བར་འགྱུར་རོ།
en: He will be their sole object of veneration, and they will all become his followers and male and female servants.

source: །ལྷ་ཁང་དུ་སོང་ནས་ལྷའི་སྤྱན་སྔར་བསྐོར་ཞིང་དོན་ཡོད་པའི་རྒྱལ་པོའི་སྙིང་པོ་བཟླས་བརྗོད་བྱས་ན་ལྷ་དེ་རང་གི་ངོ་བོ་མདུན་ན་གནས་པར་འགྱུར་རོ། །གང་བསྒོ་བ་དེ་ཐམས་ཅད་བྱེད་པར་འགྱུར་རོ། །གང་འདོད་པ་དེ་ཐམས་ཅད་སྦྱིན་བར་འགྱུར་རོ།
en: If he swings the rod in a temple before an image of a deity while reciting the heart mantra of Amogharāja, that deity will appear before him in person to do whatever it is asked to do and give whatever it is asked to give.

source: །ཉི་མ་འཆང་བའི་ཚེ་ཉི་མའི་མདུན་དུ་བསྐོར་བར་བྱ་ཞིང་དོན་ཡོད་པའི་རྒྱལ་པོའི་སྙིང་པོ་བཟླས་བརྗོད་བྱས་ན་ཉི་མ་བབས་ཏེ།
en: If he swings the rod facing the rising sun while reciting the heart mantra of Amogharāja, he will cause the god Sūrya to descend to earth and grant all the boons he desires.

source: མཆོག་གང་འདོན་པ་དེ་ཐམས་ཅད་སྦྱིན་པར་མཛད་དོ། །ཟླ་བ་ཉའི་ཞལ་དུ་བསྐོར་ཅིང་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་བཟླས་བརྗོད་བྱེད་ན་ཟླ་བ་དང་། རྒྱུ་སྐར་དང་། སྐར་མའི་ཚོགས་དང་བཅས་ཏེ་འབབ་པར་འགྱུར་རོ། །མཆོག་བསམ་པ་ཐམས་ཅད་སྦྱིན་པར་བྱེད་དོ།
en: If he swings the rod while facing the full moon and recites the heart mantra of Amoghapāśa, he will cause the god Candra, the nakṣatras, and the multitude of stars to descend to earth and grant him all the boons he desires. “

source: །རིང་བསྲེལ་དང་བཅས་པའི་མཆོད་རྟེན་ལ་སྐོར་བ་བྱེད་ཅིང་དོན་ཡོད་པའི་རྒྱལ་པོ་བཟླས་བརྗོད་བྱས་ཤིང་དབྱུག་པ་བསྐོར་ན་མཆོད་རྟེན་འབར་ཞིང་སྒྲ་འབྱུང་བར་འགྱུར་རོ།
en: If the vidyā holder circumambulates a reliquary clockwise while reciting the Amogharāja mantra and swings the rod, the reliquary will blaze with light and a voice will be heard.

source: །གང་བསམ་པ་དེ་ཐམས་ཅད་སྨྲ་བར་འགྱུར་རོ། །གང་འདོད་པ་དེ་ཐམས་ཅད་སྦྱིན་པར་མཛད་དོ།
en: The reliquary will answer in full whatever question the vidyā holder asks and will give everything he requests it to give.

source: །དེ་བཞིན་གཤེགས་པ་ལ་བསྐོར་བ་བྱ་སྟེ། དོན་ཡོད་པའི་སྙིང་པོའི་བཟླས་བརྗོད་བྱེད་ཅིང་དབྱུག་པ་བསྐོར་ན་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཐོང་བར་འགྱུར་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དབུགས་འབྱིན་པར་མཛད་པ་དང་།
en: If he swings the rod while circumambulating an image of a tathāgata clockwise while reciting the heart mantra of Amogharāja, all the tathāgatas will appear to him and give him comfort.

source: བསམ་པ་དང་རེ་བ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་མཛད་པར་འགྱུར་རོ།
en: They will fulfill his every hope and grant his every wish.

source: །ཡང་ན་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་རང་གི་སྐུ་བཞིན་ཐུན་ཐོ་རངས་ཀྱི་ཚེ་མདུན་ན་བཞུགས་པར་འགྱུར་རོ། །མཆོག་བསམ་པ་ཐམས་ཅད་སྦྱིན་པར་མཛད་པར་འགྱུར་རོ། །དགོས་པ་ཐམས་ཅད་གྲུབ་པར་མཛད་པར་འགྱུར་རོ།
en: Noble Avalokiteśvara will appear to him in person in the last watch of the night, grant all the boons the vidyā holder desires, and help him accomplish all his aims.

source: །དོན་ཡོད་པའི་དབྱུག་པ་རིག་འཛིན་འཁོར་ལོས་སྒྱུར་བ་གྲུབ་པ་ཐོབ་པར་འགྱུར་རོ།
en: The vidyā holder will become an emperor of the vidyādharas who have accomplished the amogha rod. “

source: །ཆར་མི་འབབ་པའི་ཚེ་ཀླུའི་གནས་སུ་སོང་སྟེ། དོན་ཡོད་པའི་རྒྱལ་པོའི་སྙིང་པོ་དྲན་པར་བྱ། དབྱུག་པ་བསྐོར་བར་བྱའོ། །བསྐོར་བ་ཙམ་གྱི་མོད་ལ་ཀླུ་རྣམས་ཆར་པའི་རྒྱུན་ཆེན་པོ་འབྱུང་བར་འགྱུར་རོ།
en: If during a drought the vidyā holder goes to a place inhabited by nāgas and swings the rod while mindfully repeating the heart mantra of Amogharāja, the nāgas will send a heavy rain the very moment he swings the rod.

source: །ཅི་འདོད་པའི་ཆར་གྱི་རྒྱུན་འབེབས་སོ།
en: They will send as much rain as he wishes.

source: །ཆར་ཆེས་ན་ཁང་ཐོག་ཏུ་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་སྐད་དྲག་པོས་བརྗོད་དེ།
en: If there is too much rain, the vidyā holder should recite the heart mantra of Amoghapāśa in a loud voice on top of his house and swing the rod.

source: དབྱུག་པ་བསྐོར་ན་ཆར་ཆེས་པ་འཆད་པར་འགྱུར་རོ།
en: This will stop excessive rain.

source: །སེར་བ་འབབ་པའི་ཚེ་སྤྲིན་ལོགས་སུ་བལྟས་ཏེ་ཁྲོས་པས་ཁྲོ་བོའི་རྒྱལ་པོ་སྐད་ཆེན་པོས་དྲན་པར་བྱ་ཞིང་ཁྲོས་པས་དབྱུག་པ་བསྐོར་ན་སད་དང་།
en: If it hails, the vidyā holder should stand facing the cloud and angrily recite the mantra of Krodharāja in a loud voice while waving the rod with anger.

source: རླུང་དང་སེར་བ་མི་འབབ་པར་འགྱུར་རོ། །དཔག་ཚད་ཚུན་ཚད་དུ་མཚམས་ཆེན་པོ་ཀུན་ཏུ་བཅད་པར་འགྱུར་རོ།
en: Subsequently, there will be no cold, wind, or hail, and a great protective boundary will be created for a radius of one league. “

source: །གདོན་ཀུན་གྱིས་ཟིན་པ་ལ་ཁྲོ་བོའི་རྒྱལ་པོ་ལ་ལན་བདུན་དྲན་པར་བྱ་ཞིང་དབྱུགས་པ་བསྟན་ན་གདོན་ཐམས་ཅད་དུ་ཞིང་འབྲོས་པར་འགྱུར་རོ།
en: In the event of epileptic seizures, the vidyā holder should repeat the mantra of Krodharāja seven times while displaying the rod. All grahas will flee, crying.

source: །བརྗེད་བྱེད་ལ་སོགས་པའི་བར་ལ་བསྟན་པ་ཙམ་གྱིས་འབྲོས་པར་འགྱུར་རོ།
en: All such spirits, including apasmāras, will flee at the mere sight of the rod.

source: །རིམས་ཐམས་ཅད་ལ་དོན་ཡོད་པའི་རྒྱལ་བོའི་སྙིང་པོས་བྱབས་ན་བྱབས་པ་ཙམ་གྱི་མོད་ལ་རིམས་ཐམས་ཅད་ལས་ཐར་བར་འགྱུར་རོ།
en: In the event of any fever, he should cleanse the patient by rubbing him with the rod while reciting the heart mantra of Amogharāja. As soon as he rubs the patient, all the jvaras will depart.

source: །ཞག་བཞི་པའི་རིམས་ནི་ངུ་ཞིང་འབྲོས་པར་འགྱུར་རོ།
en: The jvaras of quartan fever will flee, crying.

source: །གཡུལ་འགྱེད་ཅིང་འཐབ་པའི་ཚེ་དོན་ཡོད་པའི་རྒྱལ་པོའི་སྙིང་པོ་ཁྲོས་པས་བཟླས་བརྗོད་བྱ། དབྱུག་པ་བསྐོར་བ་བྱས་ན་མཚོན་དང་། དགྲ་སྟ་དང་། ལག་ཆ་ཐམས་ཅད་མི་སྣང་བར་འགྱུར་ཞིང་།
en: If the vidyā holder enters the thick of battle while angrily reciting the heart mantra of Amogharāja and swinging the rod, all the soldiers’ weapons and armaments will disappear.

source: ཕ་རོལ་གྱི་དཔུང་རྣམས་ཀྱི་ཧུད་ཀྱི་ཧུད་ཟེར་ཞིང་འབྲོས་པར་འགྱུར་རོ།
en: The enemy army will flee, uttering cries of woe. “

source: །འབྲོག་དགོན་པའི་ནང་དུ་འགྲོན་པོ་རྣམས་སོང་བ་ན་དོན་ཡོད་པའི་རྒྱལ་པོ་དྲན་པར་བྱ་ཞིང་དབྱུག་པ་བསྐོར་བ་བྱས་ན་རྐུན་པོ་དང་། ཆོམ་པོ་དང་། མི་རྒོད་དང་། སེང་གེ་དང་། སྟག་དང་། དོམ་དང་། དྲེད་དང་།
en: When entering a forest or wilderness in the company of fellow travelers, the vidyā holder should mindfully repeat the Amogharāja mantra and swing the rod.

source: དུག་མི་བཟད་པ་དང་། གཅན་གཟན་ཁྲོ་བོ་དང་། གླང་པོ་ཆེ་དང་། མ་ཧེ་དང་། དུག་དང་བཅས་པའི་སྲོག་ཆགས་དེ་དག་ཐམས་ཅད་མི་སྣང་བར་འགྱུར་རོ།
en: All thieves, bandits, robbers, lions, tigers, bears, wolves, venomous snakes, small predators, elephants, buffalo, and venomous creatures will disappear.

source: །རང་གི་ཁྱིམ་དུ་བདེ་བར་འགྲོ་བར་འགྱུར་རོ། །མི་ངས་ཐམས་ཅད་དང་། བ་ལང་གི་ནད་དང་། ཕྱུགས་ངས་ཆེན་པོ་དང་།
en: The travelers will each return to their homes in safety and comfort.

source: རྟ་ནད་ཆེན་པོ་དང་། བུད་མེད་དང་། སྐྱེས་པ་དང་། ཁྱེའུ་དང་བུ་མོའི་ནད་ཆེན་པོ་བྱུང་བའི་ཚེ་དོན་ཡོད་པའི་རྒྱལ་བོའི་སྙིང་པོ་དང་། ཁྲོ་བོའི་རྒྱལ་པོའི་སྐད་ཆེན་པོས་དྲན་པར་བྱ་ཞིང་དབྱུག་པ་གྲོང་ཁྱེར་གྱི་སྒོ་བཞིར་བསྐོར་བ་བྱས་ན་བསྐོར་བ་ཙམ་གྱི་མོད་ལ་མི་ངས་དང་། གནོད་པ་དང་། ཉོན་མོངས་པ་དང་། འཁྲུག་པ་ཐམས་ཅད་པ་དང་།
en: In the event of any calamities, cattle plagues, horse plagues, the dying of livestock, or deadly pestilences that affect women, men, boys, and girls, the vidyā holder should recite the heart mantra of Amogharāja and the mantra of Krodharāja in a loud voice while swinging the rod at each of the four gates of the affected city.

source: འཐབ་པ་དང་། རྩོད་པ་དང་། འགྱེད་པ་དང་། མཚང་འདྲུ་བ་ཐམས་ཅད་ཞི་བར་འགྱུར་རོ། །འཇིགས་པ་ཐམས་ཅད་ལས་གྲོལ་བར་འགྱུར་རོ།
en: As soon as he swings the rod, all calamities, misfortunes, disasters, catastrophes, quarrels, disputes, and disagreements will be pacified, and everyone will be freed from fear. “

source: །བུད་མེད་དང་། སྐྱེས་པ་དགུག་པར་འདོད་ན་གནས་མཐོན་པོར་འདུག་སྟེ། སྐད་ཆེན་པོས་དོན་ཡོད་པའི་རྒྱལ་པོའི་སྙིང་པོ་ལན་ཉི་ཤུ་རྩ་གཅིག་དྲན་པར་བྱའོ། །དབྱུག་པ་བསྐོར་བར་བྱའོ།
en: If the vidyā holder wants to bring a specific woman or man into his presence, he should stand at an elevated spot and recite the heart mantra of Amogharāja twenty-one times in a loud voice while swinging the rod.

source: །གང་གི་ཆེད་དུ་བྱ་བ་དེ་མིང་བརྗོད་པར་བྱས་ན་དཔག་ཚད་བརྒྱ་ནས་ཀྱང་དེ་འོང་ཞིང་བདག་དང་ནོར་ལ་དབང་བྱ་བར་ཡོད་ཅིང་གནས་པར་འགྱུར་རོ།
en: He should focus on the name of the person targeted by the rite, and they will come, even from one hundred leagues away.

source: །ཇི་སྲིད་འཚོའི་བར་དུ་འགྱུར་རོ།
en: They will fall under his thrall and serve him physically and with their wealth, and they will continue to do so for as long as they live. “

source: །འོན་ཏེ་ནོར་བུ་བཟང་པོའི་སྲས་དགུག་པར་འདོད་ན་ཟླ་བ་ཡར་གྱི་ངོ་ཚེས་བཅུ་བཞི་ལ་སྨྱུང་བ་བྱས་ཏེ། དབྱུག་པ་ལ་དོན་ཡོད་པའི་རྒྱལ་པོའི་སྙིང་པོ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་བརྗོད་བྱ་སྟེ།
en: If the vidyā holder wants to summon Maṇibhadra, he should fast for one day and one night and then, on the fourteenth day of the dark fortnight, incant the rod with the heart mantra of Amogharāja twenty-one times.

source: ནོར་བཟངས་ཀྱི་སྲས་ཀྱི་ལྟོ་བའི་སྟེང་དུ་གཞག་པར་བྱ། ཁྲོ་བོའི་རྒྱལ་པོ་བཟླས་པ་བྱས་ན་བཞི་ཐུན་གྱི་ཐོ་རངས་ཙམ་ན་ནོར་བུ་བཟང་པོའི་སྲས་རང་ཉིད་རིག་སྔགས་འཆང་བའི་མདུན་ན་བཞུགས་པར་འགྱུར་ཞིང་གསེར་གྱི་དོང་ཙེ་སྟོང་ཕྲག་བཅུ་སྦྱིན་པར་མཛད་དོ།
en: He should then place the rod against the belly of Maṇibhadra and recite the mantra of Krodharāja until Maṇibhadra appears before the vidyā holder in person during the last watch of the night and gives him ten thousand dinars.

source: །དེ་ལས་དཀོན་མཆོག་གསུམ་གྱི་སྐུ་སྐལ་དབུལ་བར་བྱ།
en: A part of this amount should be offered to the Three Jewels.

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་མཆོད་པར་བྱ། ནོར་བུ་བཟང་པོའི་སྲས་ལ་མཆོད་ཡོན་གྱི་ཆབ་དབུལ་བར་བྱ།
en: The vidyā holder should make offerings to Noble Avalokiteśvara and offer argha water to Maṇibhadra.

source: ཉི་མ་རེ་རེ་ཞིང་ནོར་བཟངས་ཀྱི་སྲས་ལ་མཆོད་ཡོན་གྱི་ཆབ་ཕུལ་ན་ནམ་འཚོའི་བར་དུ་ཉི་མ་རེ་རེ་ཞིང་གསེར་གྱི་དོང་ཙེ་སྟོང་སྦྱིན་པར་མཛད་དོ།
en: If he offers the argha water to him every single day, Maṇibhadra will give the vidyā holder one thousand dinars every day for as long as he lives.

source: །དེ་ནས་རིག་སྔགས་འཆང་བས་ཕྱེད་དང་བཞི་ཆ་གཅིག་དགོད་པར་བྱ་སྟེ། སྦྱིན་པ་སྦྱིན་པར་བྱ། བསོད་ནམས་བསགས་པར་བྱས་ལ། ནོར་བུ་བཟང་པོའི་སྲས་དང་ལྷན་ཅིག་ཏུ་རྗེས་སུ་ཡི་རང་བར་བྱའོ།
en: The vidyā holder should spend half of it and give the other half away, thus accumulating merit and pleasing Maṇibhadra. “

source: །འབྲོག་དགོན་པའི་ནང་དུ་སོང་བ་ན། འབྲོག་དགོན་པ་གང་ན་ཆུ་དཀོན་པར་དབྱུག་པ་ལ་ལན་ཉི་ཤུ་རྩ་གཅིག་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་བཟླས་བརྗོད་བྱ་ཞིང་གང་ན་ནེའུ་གསིང་སྔོན་པོ་ཡོད་པའི་གནས་དེར་ས་ལ་ལན་བདུན་བརྡབ་ཅིང་བསྐོར་ཏེ་སྐད་དྲག་པོས་དོན་ཡོད་པའི་རྒྱལ་པོའི་སྙིང་པོ་དྲན་པར་བྱ།
en: If the vidyā holder finds himself in a forest or a desert without water, he should incant the rod with the heart mantra of Amoghapāśa twenty-one times, swing the rod, and strike the ground at a grassy spot seven times while reciting the heart mantra of Amogharāja in a loud voice seven times.
